OpenDTEF-v2012/tutorials/incompressible/pimpleFoam/RAS/TJunctionArrheniusBirdCarreauTransport/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

functions
{
    sTransport
    {
        type            energyTransport;
        libs             (solverFunctionObjects);

        enabled         true;
        writeControl    outputTime;
        writeInterval   1;

        field           T;

        phi             phi;

        // Thermal properties
        Cp              Cp    [J/kg/K]  1e3;
        kappa           kappa [W/m/K]   0.0257;
        rhoInf          rho   [kg/m^3]  1.2;

        write           true;

        fvOptions
        {
            viscousDissipation
            {
                type            viscousDissipation;
                enabled         true;

                viscousDissipationCoeffs
                {
                    fields          (T);
                    rhoInf          $....rhoInf;
                }
            }
        }
    }
}

// ************************************************************************* //
